; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	thermograph1 - mode
	image2 - mode
	Star1 - direction
	GroundStation14 - direction
	Star7 - direction
	GroundStation11 - direction
	GroundStation3 - direction
	GroundStation12 - direction
	Star9 - direction
	GroundStation2 - direction
	Star10 - direction
	Star6 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Star13 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Phenomenon21 - direction
	Phenomenon22 - direction
	Planet23 - direction
	Phenomenon24 - direction
	Phenomenon25 - direction
	Star26 - direction
	Star27 - direction
	Star28 - direction
	Planet29 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 Star7)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 image2)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 thermograph1)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star7)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
	(supports instrument4 image2)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation5)
	(calibration_target instrument4 GroundStation12)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph1)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation8)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star10)
	(supports instrument7 thermograph1)
	(supports instrument7 thermograph0)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 Star13)
	(calibration_target instrument7 Star0)
	(supports instrument8 thermograph1)
	(supports instrument8 thermograph0)
	(supports instrument8 image2)
	(calibration_target instrument8 Star13)
	(calibration_target instrument8 GroundStation8)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation8)
)
(:goal (and
	(pointing satellite0 Star27)
	(pointing satellite1 Star28)
	(pointing satellite2 Phenomenon21)
	(pointing satellite3 Star0)
	(have_image Planet15 image2)
	(have_image Phenomenon16 thermograph1)
	(have_image Planet17 thermograph0)
	(have_image Planet18 image2)
	(have_image Phenomenon19 thermograph0)
	(have_image Phenomenon20 thermograph0)
	(have_image Phenomenon21 thermograph0)
	(have_image Phenomenon22 thermograph0)
	(have_image Planet23 image2)
	(have_image Phenomenon24 thermograph1)
	(have_image Phenomenon25 image2)
	(have_image Star26 thermograph0)
	(have_image Star27 thermograph0)
	(have_image Star28 image2)
	(have_image Planet29 thermograph1)
))

)

; plan
1. (turn_to satellite3 star0 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 star0)
   goals met: 1 of 19
2. (turn_to satellite2 phenomenon21 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 phenomenon21)
   goals met: 2 of 19
3. (turn_to satellite1 star28 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star28)
   goals met: 3 of 19
4. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 19
5. (calibrate satellite0 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 3 of 19
6. (turn_to satellite0 phenomenon21 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon21)
   goals met: 3 of 19
7. (take_image satellite0 phenomenon21 instrument2 thermograph0)
   added: (have_image phenomenon21 thermograph0)
   goals met: 4 of 19
8. (turn_to satellite0 phenomenon20 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 phenomenon20)
   goals met: 4 of 19
9. (take_image satellite0 phenomenon20 instrument2 thermograph0)
   added: (have_image phenomenon20 thermograph0)
   goals met: 5 of 19
10. (turn_to satellite0 phenomenon19 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon19)
   goals met: 5 of 19
11. (take_image satellite0 phenomenon19 instrument2 thermograph0)
   added: (have_image phenomenon19 thermograph0)
   goals met: 6 of 19
12. (turn_to satellite0 phenomenon16 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 phenomenon16)
   goals met: 6 of 19
13. (take_image satellite0 phenomenon16 instrument2 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 7 of 19
14. (turn_to satellite0 phenomenon22 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon22)
   goals met: 7 of 19
15. (take_image satellite0 phenomenon22 instrument2 thermograph0)
   added: (have_image phenomenon22 thermograph0)
   goals met: 8 of 19
16. (turn_to satellite0 phenomenon24 phenomenon22)
   deleted: (pointing satellite0 phenomenon22)
   added: (pointing satellite0 phenomenon24)
   goals met: 8 of 19
17. (take_image satellite0 phenomenon24 instrument2 thermograph1)
   added: (have_image phenomenon24 thermograph1)
   goals met: 9 of 19
18. (turn_to satellite0 phenomenon25 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 phenomenon25)
   goals met: 9 of 19
19. (take_image satellite0 phenomenon25 instrument2 image2)
   added: (have_image phenomenon25 image2)
   goals met: 10 of 19
20. (turn_to satellite0 planet15 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 planet15)
   goals met: 10 of 19
21. (take_image satellite0 planet15 instrument2 image2)
   added: (have_image planet15 image2)
   goals met: 11 of 19
22. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 11 of 19
23. (take_image satellite0 planet17 instrument2 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 12 of 19
24. (turn_to satellite0 planet18 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet18)
   goals met: 12 of 19
25. (take_image satellite0 planet18 instrument2 image2)
   added: (have_image planet18 image2)
   goals met: 13 of 19
26. (turn_to satellite0 planet23 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet23)
   goals met: 13 of 19
27. (take_image satellite0 planet23 instrument2 image2)
   added: (have_image planet23 image2)
   goals met: 14 of 19
28. (turn_to satellite0 planet29 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 planet29)
   goals met: 14 of 19
29. (take_image satellite0 planet29 instrument2 thermograph1)
   added: (have_image planet29 thermograph1)
   goals met: 15 of 19
30. (turn_to satellite0 star26 planet29)
   deleted: (pointing satellite0 planet29)
   added: (pointing satellite0 star26)
   goals met: 15 of 19
31. (take_image satellite0 star26 instrument2 thermograph0)
   added: (have_image star26 thermograph0)
   goals met: 16 of 19
32. (turn_to satellite0 star28 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star28)
   goals met: 16 of 19
33. (take_image satellite0 star28 instrument2 image2)
   added: (have_image star28 image2)
   goals met: 17 of 19
34. (turn_to satellite0 star27 star28)
   deleted: (pointing satellite0 star28)
   added: (pointing satellite0 star27)
   goals met: 18 of 19
35. (take_image satellite0 star27 instrument2 thermograph0)
   added: (have_image star27 thermograph0)
   goals met: 19 of 19
